# 딕셔너리 조작
#1
# num = {
#     '홍길동': '010-1111-1111',
#     '이순신': '010-1111-2222',
#     '강감찬': '010-1111-3333'
# }
# for k in num.keys():
#     print(k)
# print()
# a = input()
# print('{}의 전화번호는 {}입니다'.format(a, num[a]))

#2
a = {'아메리카노': 1900, '카페모카': 3300, '에스프레소': 1900, '카페라떼': 2500, '카푸치노': 2500, '바닐라라떼': 2900}
b = {'헤이즐럿라떼': 2900, '카페모카': 3300, '밀크커피': 3300, '아메리카노': 1900, '샷크린티라떼': 3300}
b.update(a)
print(b)
c = set()
for k, v in b.items():
    if v >= 3000:
        c.add((k, v))
print(c)

